In [1]:
#import pandas library
import pandas as pd

In [2]:
#Creating Data Frame
dictionary= {"course_name":["machine learning","signals and systems","software engineering","computer network"],
             "lecturer_name":["Burak Cetin","Ahmet Bulut","Berk Saat","Metin Pas"],
             "std_number":[199,207,135,418]}
dataframe1=pd.DataFrame(dictionary)
print(dataframe1)

            course_name lecturer_name  std_number
0      machine learning   Burak Cetin         199
1   signals and systems   Ahmet Bulut         207
2  software engineering     Berk Saat         135
3      computer network     Metin Pas         418

In [3]:
# head function returns the first n row
head1= dataframe1.head()
print(head1)

            course_name lecturer_name  std_number
0      machine learning   Burak Cetin         199
1   signals and systems   Ahmet Bulut         207
2  software engineering     Berk Saat         135
3      computer network     Metin Pas         418

In [4]:
head2=dataframe1.head(2)   #first two rows
print(head2)

           course_name lecturer_name  std_number
0     machine learning   Burak Cetin         199
1  signals and systems   Ahmet Bulut         207

In [5]:
#tail function returns the last n row
tail1=dataframe1.tail()
print(tail1)

            course_name lecturer_name  std_number
0      machine learning   Burak Cetin         199
1   signals and systems   Ahmet Bulut         207
2  software engineering     Berk Saat         135
3      computer network     Metin Pas         418

In [6]:
tail2=dataframe1.tail(2)     #last two rows
print(tail2)

            course_name lecturer_name  std_number
2  software engineering     Berk Saat         135
3      computer network     Metin Pas         418

# Basic Features

In [7]:
print(dataframe1.columns)    #gives columns names of dataframe

Index(['course_name', 'lecturer_name', 'std_number'], dtype='object')

In [8]:
print(dataframe1.dtypes)     #gives types of columns

course_name      object
lecturer_name    object
std_number        int64
dtype: object

In [9]:
print(dataframe1.info())      #gives information about dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   course_name    4 non-null      object
 1   lecturer_name  4 non-null      object
 2   std_number     4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes
None

In [10]:
print(dataframe1.describe())        #only valid for integer number , max,min,median

       std_number
count     4.00000
mean    239.75000
std     123.12426
min     135.00000
25%     183.00000
50%     203.00000
75%     259.75000
max     418.00000

In [11]:
print(dataframe1["lecturer_name"])   #returns lecturer_names column , column's name and its type

0    Burak Cetin
1    Ahmet Bulut
2      Berk Saat
3      Metin Pas
Name: lecturer_name, dtype: object

In [12]:
print(dataframe1.loc[:,"std_number"])   #returns std_number column , column's name and its type

0    199
1    207
2    135
3    418
Name: std_number, dtype: int64

In [13]:
print(dataframe1.loc[:3,"std_number"])

0    199
1    207
2    135
3    418
Name: std_number, dtype: int64

In [14]:
print(dataframe1.loc[:2,"course_name":"std_number"])  #Returns the part of the first two rows from course_name to std_number.

            course_name lecturer_name  std_number
0      machine learning   Burak Cetin         199
1   signals and systems   Ahmet Bulut         207
2  software engineering     Berk Saat         135

In [15]:
print(dataframe1.loc[::-1])                          #Reverse of data frame

            course_name lecturer_name  std_number
3      computer network     Metin Pas         418
2  software engineering     Berk Saat         135
1   signals and systems   Ahmet Bulut         207
0      machine learning   Burak Cetin         199

In [16]:
print(dataframe1.iloc[:,[1]])                      #Returns first column of index

  lecturer_name
0   Burak Cetin
1   Ahmet Bulut
2     Berk Saat
3     Metin Pas

# Filter Process

In [20]:
filt= dataframe1.std_number>200                      #If std_num greater than 200->true else false
dataframe1["bool"]= filt
print(dataframe1.loc[:,["std_number","bool"]])

   std_number   bool
0         199  False
1         207   True
2         135  False
3         418   True

In [21]:
filter_data= dataframe1[filt]
print(filter_data)

           course_name lecturer_name  std_number  bool
1  signals and systems   Ahmet Bulut         207  True
3     computer network     Metin Pas         418  True

In [23]:
filt2=dataframe1.std_number<400
filtered_data=dataframe1[filt&filt2]
print(filtered_data)

           course_name lecturer_name  std_number  bool
1  signals and systems   Ahmet Bulut         207  True

In [24]:
type(filt)                         #In pandas library, we can say "series"

pandas.core.series.Series

In [25]:
#Find average with Pandas
avg_pandas=dataframe1.std_number.mean()
print(avg_pandas)

import numpy as np
#Find average with Numpy 
avg_numpy=np.mean(dataframe1.std_number)
print(avg_numpy)

239.75
239.75

In [26]:
dictionary= {"name":["Burak","Ahmet","Berk","Metin","Aslı","Fatma","Ebru","Besim","Pelin"],
             "age":[40,38,32,28,17,22,23,18,37],
             "price":[200,300,245,350,None,325,750,900,None]}
dataframe2=pd.DataFrame(dictionary)
print(dataframe2)

    name  age  price
0  Burak   40  200.0
1  Ahmet   38  300.0
2   Berk   32  245.0
3  Metin   28  350.0
4   Aslı   17    NaN
5  Fatma   22  325.0
6   Ebru   23  750.0
7  Besim   18  900.0
8  Pelin   37    NaN

In [27]:
dataframe2.dropna(inplace=True)         #Removes none index from data frame
print(dataframe2)

    name  age  price
0  Burak   40  200.0
1  Ahmet   38  300.0
2   Berk   32  245.0
3  Metin   28  350.0
5  Fatma   22  325.0
6   Ebru   23  750.0
7  Besim   18  900.0

In [28]:
#Creating new column 
print(dataframe2.price.mean())     #Returns avg of price
dataframe2["price_avg"]=["Below average" if dataframe2.price.mean()> each else "Upper average" for each in dataframe2.price]
dataframe2

438.57142857142856

    name  age  price      price_avg
0  Burak   40  200.0  Below average
1  Ahmet   38  300.0  Below average
2   Berk   32  245.0  Below average
3  Metin   28  350.0  Below average
5  Fatma   22  325.0  Below average
6   Ebru   23  750.0  Upper average
7  Besim   18  900.0  Upper average

In [30]:
dataframe2["new_future"]=[1,2,3,4,5,6,7]
dataframe2.columns = [each.split('_')[0]+" "+each.split('_')[1] if len(each.split('_'))>1 else each for each in dataframe2.columns]
dataframe2

    name  age  price      price avg  new future
0  Burak   40  200.0  Below average           1
1  Ahmet   38  300.0  Below average           2
2   Berk   32  245.0  Below average           3
3  Metin   28  350.0  Below average           4
5  Fatma   22  325.0  Below average           5
6   Ebru   23  750.0  Upper average           6
7  Besim   18  900.0  Upper average           7

# Concatenate Data

In [32]:
dt= dataframe2.head()                                   #concatenated vertically
dt2=dataframe2.tail()
concatenated_data = pd.concat([dt,dt2],axis=0)
concatenated_data

    name  age  price      price avg  new future
0  Burak   40  200.0  Below average           1
1  Ahmet   38  300.0  Below average           2
2   Berk   32  245.0  Below average           3
3  Metin   28  350.0  Below average           4
5  Fatma   22  325.0  Below average           5
2   Berk   32  245.0  Below average           3
3  Metin   28  350.0  Below average           4
5  Fatma   22  325.0  Below average           5
6   Ebru   23  750.0  Upper average           6
7  Besim   18  900.0  Upper average           7

In [33]:
concatenated_data2 = pd.concat([dt,dt2],axis=1)     #Concetenated horizontally
concatenated_data2

,name,age,price,price avg,new future,name,age,price,price avg,new future
0,Burak,40.0,200.0,Below average,1.0,NaN,NaN,NaN,NaN,NaN
1,Ahmet,38.0,300.0,Below average,2.0,NaN,NaN,NaN,NaN,NaN
2,Berk,32.0,245.0,Below average,3.0,Berk,32.0,245.0,Below average,3.0
3,Metin,28.0,350.0,Below average,4.0,Metin,28.0,350.0,Below average,4.0
5,Fatma,22.0,325.0,Below average,5.0,Fatma,22.0,325.0,Below average,5.0
6,NaN,NaN,NaN,NaN,NaN,Ebru,23.0,750.0,Upper average,6.0
7,NaN,NaN,NaN,NaN,NaN,Besim,18.0,900.0,Upper average,7.0

# Transform Data

In [35]:
dataframe2["big_age"] = [each*4 for each in dataframe2.age]      #Multiply by 4 each age and added new column
dataframe2

    name  age  price      price avg  new future  big_age
0  Burak   40  200.0  Below average           1      160
1  Ahmet   38  300.0  Below average           2      152
2   Berk   32  245.0  Below average           3      128
3  Metin   28  350.0  Below average           4      112
5  Fatma   22  325.0  Below average           5       88
6   Ebru   23  750.0  Upper average           6       92
7  Besim   18  900.0  Upper average           7       72

In [36]:
#Multiply by 4 each age with using function
def multiply_age(ages):
    return ages*4
dataframe2["function"]=dataframe2.age.apply(multiply_age)
dataframe2

    name  age  price      price avg  new future  big_age  function
0  Burak   40  200.0  Below average           1      160       160
1  Ahmet   38  300.0  Below average           2      152       152
2   Berk   32  245.0  Below average           3      128       128
3  Metin   28  350.0  Below average           4      112       112
5  Fatma   22  325.0  Below average           5       88        88
6   Ebru   23  750.0  Upper average           6       92        92
7  Besim   18  900.0  Upper average           7       72        72

# DataSet Process

In [38]:
#We can add a dataset 
dataset1= pd.read_csv("Video_Games1.csv")
dataset1.head()

,Name,Platform,Year_of_Release,Genre,Publisher,NA_Sales,EU_Sales,JP_Sales,Other_Sales,Global_Sales,Critic_Score,Critic_Count,User_Score,User_Count,Developer,Rating
0,Wii Sports,Wii,2006.0,Sports,Nintendo,41.36,28.96,3.77,8.45,82.53,76.0,51.0,8,322.0,Nintendo,E
1,Super Mario Bros.,NES,1985.0,Platform,Nintendo,29.08,3.58,6.81,0.77,40.24,NaN,NaN,NaN,NaN,NaN,NaN
2,Mario Kart Wii,Wii,2008.0,Racing,Nintendo,15.68,12.76,3.79,3.29,35.52,82.0,73.0,8.3,709.0,Nintendo,E
3,Wii Sports Resort,Wii,2009.0,Sports,Nintendo,15.61,10.93,3.28,2.95,32.77,80.0,73.0,8,192.0,Nintendo,E
4,Pokemon Red/Pokemon Blue,GB,1996.0,Role-Playing,Nintendo,11.27,8.89,10.22,1.00,31.37,NaN,NaN,NaN,NaN,NaN,NaN

In [39]:
dataset1.dtypes

Name                object
Platform            object
Year_of_Release    float64
Genre               object
Publisher           object
NA_Sales           float64
EU_Sales           float64
JP_Sales           float64
Other_Sales        float64
Global_Sales       float64
Critic_Score       float64
Critic_Count       float64
User_Score          object
User_Count         float64
Developer           object
Rating              object
dtype: object

In [40]:
dataset1.Genre.value_counts()

Action          3370
Sports          2348
Misc            1750
Role-Playing    1500
Shooter         1323
Adventure       1303
Racing          1249
Platform         888
Simulation       874
Fighting         849
Strategy         683
Puzzle           580
Name: Genre, dtype: int64